In [1]:
import pandas as pd

In [2]:
data = {'nama_lengkap' : ['Thomas Brian', 'Dewi Sartika', 'Camilla Ava'],
        'tempat_lahir' : ['Tulungagung, Jawa Timur', 'Salappa, Mentawai', 'Sidoarjo, Jawa Timur']}

df = pd.DataFrame(data)
df

   nama_lengkap             tempat_lahir
0  Thomas Brian  Tulungagung, Jawa Timur
1  Dewi Sartika        Salappa, Mentawai
2   Camilla Ava     Sidoarjo, Jawa Timur

In [4]:
df[['nama_depan'], ['nama_belakang']] = df['nama_lengkap'].str.split(' ', expand=True)
df

SyntaxError: unmatched ']' (1757272400.py, line 1)